{"keras_version": "1.1.0", "config": [{"config": {"W_constraint": null, "output_dim": 200, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 1800], "activation": "linear", "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 1000, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 800, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 300, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_4", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 100, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_5", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 50, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_6", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 30, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_7", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 30, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_8", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_10"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "output_dim": 75, "input_dim": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_9", "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_12"}, "class_name": "Activation"}], "class_name": "Sequential"}